---
kind: method
id: M:Autodesk.Revit.DB.ScheduleDefinition.GetValidCategoriesForEmbeddedSchedule
source: html/ad3de021-c17d-6a5f-a196-cdf6b43e11ba.htm
---
# Autodesk.Revit.DB.ScheduleDefinition.GetValidCategoriesForEmbeddedSchedule Method

Get all categories that can be used for an embedded ScheduleDefinition
 in this ScheduleDefinition.

## Syntax (C#)
```csharp
public ICollection<ElementId> GetValidCategoriesForEmbeddedSchedule()
```

## Returns
The IDs of all valid categories.